module.exports = {
  phone: {
    title: '手机号码',
    pattern: /^1[3-9]\d{9}$/,
    error: '不是一个合法的手机号码'
  },
  password: {
    title: '密码',
    pattern: /^(?![a-zA-Z]+$)(?![\d]+$)(?![\W_]+$)[^\s]{6,16}$/,
    error: '密码6-16位，至少包含数字、字母（区分大小写）、符号中的2种，且不能有空格'
  },
  email: {
    title: '邮箱',
    pattern: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/,
    error: '不是一个合法的邮箱'
  },
  idNumber: {
    title: '身份证号码',
    pattern: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,
    error: '不是一个合法的身份证号码'
  },
  nick: {
    title: '昵称',
    pattern: /^[A-Za-z0-9\u4e00-\u9fa5]{2,16}$/,
    error: '昵称只能只包含字母、数字或汉字，2-16位'
  },
  username: {
    title: '用户名',
    pattern: /^[A-Za-z0-9]{2,16}$/,
    error: '用户名只能只包含字母、数字，2-16位'
  }
};
